// 获取本地存储中的书籍数据
let books = [
    {
        id: 1,
        title: '十日终焉',
        coverImg: '/images/十日终焉.jpg',
        author: '杀虫队队员',
        category: '悬疑脑洞',
        completed: false,
        wordCount: 149.2,
        readCount: 223.2,
        description: '（不后宫，不套路，不无敌，不系统，不无脑，不爽文，介意者慎入。） 当我以为这只是寻常的一天时，却发现自己被捉到了终焉之地。 当我以为只需要不断的参加死亡游戏就可以逃脱时，却发现众人开始觉醒超自然之力。 当我以为这里是「造神之地」时，一切却又奔着湮灭走去。',
        updateTime: '2023-11-25 23:01',
        chapters: [
            {
                chapterId: 1,
                chapterTitle: "第1章 空屋",
                chapterContent: "由于版权原因，各位读者请前往官网阅读~"
            },
            {
                chapterId: 2,
                chapterTitle: "第2章 说谎",
                chapterContent: "由于版权原因，各位读者请前往官网阅读~"
            },
        ],
        isRead: false
    }, {
        id: 2,
        title: '我在精神病院学斩神',
        coverImg: '/images/我在精神病院学斩神.jpg',
        author: '三九音域',
        category: '都市脑洞',
        completed: true,
        wordCount: 425.9,
        readCount: 190.8,
        description: '你是否想过，在霓虹璀璨的都市之下，潜藏着来自古老神话的怪物？ 你是否想过，在那高悬于世人头顶的月亮之上，伫立着守望人间的神明？ 你是否想过，在人潮汹涌的现代城市之中，存在代替神明行走人间的超凡之人？ 人类统治的社会中，潜伏着无数诡异； 在那些无人问津的生命禁区，居住着古老的神明。 炽天使米迦勒，冥王哈迪斯，海神波塞冬…… 而属于大夏的神明，究竟去了何处？ 在这属于“人”的世界，“神秘”需要被肃清！',
        updateTime: '2023-09-26 20:44',
        chapters: [
            {
                chapterId: 1,
                chapterTitle: '第1章 黑缎缠目',
                chapterContent: '由于版权原因，各位读者请前往官网阅读~'
            },
            {
                chapterId: 2,
                chapterTitle: '第2章 月亮上的天使',
                chapterContent: '由于版权原因，各位读者请前往官网阅读~'
            },
        ],
        isRead: false
    }, {
        id: 3,
        title: '全家反派读我心后，人设都崩了',
        coverImg: '/images/全家反派读我心后，人设都崩了.jpg',
        author: '喵金金',
        category: '古言脑洞',
        completed: false,
        wordCount: 99.7,
        readCount: 162.8,
        description: '原书名：全家反派读我心后，人设都崩了【穿书+全家读心术+团宠+架空+暴君+甜宠+发疯+无脑】尉迟曦穿书了，穿成了出生就被亲娘抛弃，后期苟活却被抓回宫成为女主垫脚石的大炮尉迟曦生无可恋的等着被亲娘抛弃，结果，亲娘留下了她？尉迟曦看着亲娘，叹气，“娘啊，你马上就要死了！德妃要来害你了！”娴妃：……然后娴妃反杀了。尉迟曦看着暴君，“爹爹啊，想不到吧，你三年以后就会被你的大儿子搞死！你现在都是在帮他打下基业。”暴君：？？？大皇子被查出藏匿皇袍，无了。到死他都不知道自己怎么暴露的。之后暴君便带着尉迟曦上朝。暴君：让朕看看谁是奸臣！！尉迟曦吐槽着，发现暴君身边的奸臣越来越少了，爹娘感情也越来越好了，皇朝也越来越昌盛了，女主也没出现。尉迟曦：？？？穿错书了吗？',
        updateTime: '2023-11-25 23: 30', chapters: [
            { chapterId: 1, chapterTitle: '第001章 芜湖，穿书了', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
            { chapterId: 2, chapterTitle: '第002章 这马屁拍的', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
        ],
        isRead: false
    }, {
        id: 4,
        title: '缚春情',
        coverImg: '/images/缚春情.jpg',
        author: '任欢游',
        category: '宫斗宅斗',
        completed: true,
        wordCount: 59.7,
        readCount: 55.3,
        description: '【实体书已发售，各平台可购买搜笔名】江宋二府世代交好，宋挽未出生便同江行简定下婚约。二人青梅竹马，她困于后宅，一生所学不过为做江家妇准备。少年鲜衣怒马志向高远，未及弱冠便远赴边关建功立业，临行前江行简亲手为她戴上白玉簪。一句等我，宋挽便入了心，哪怕他战死沙场，她也执意抱着灵位嫁入城阳侯府。她将少年藏在心尖守寡六年，却等到江行简带着挚爱回京。少年挚爱言行古怪，她夏日制冰，制火器扶持侯府扶摇而上。宋挽看着他拥人入怀，予那少女万千宠爱。也看着他亲手将掌家之权从她手中夺走，只为博美人一笑。世家从无和离妇，宋挽抛弃所有离开侯府，却被一个离经叛道横行无忌的男人缠上。谁知江行简又幡然醒悟。江行简: 宋氏生为我的人，死为我的鬼。沈千聿: 你找你的死鬼，我要我的阿挽……',
        updateTime: '2023-11-27 00:34',
        chapters: [
            { chapterId: 1, chapterTitle: '第1章 归来', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
            { chapterId: 2, chapterTitle: '第2章 钗裙', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
        ],
        isRead: false
    }, {
        id: 5,
        title: '软诱',
        coverImg: '/images/软诱.jpg',
        author: '久久萋',
        category: '现代言情',
        completed: true,
        wordCount: 39.1,
        readCount: 37.6,
        description: '【先婚后爱➕暗恋➕追妻火葬场女主不回头➕双洁】她是徐家的养女，是周越添的小尾巴，她从小到大都跟着他，直到二十四岁这年，她听到他说——“徐家的养女而已，我怎么会真的把她放在心上，咱们这种人家，还是要门当户对。”-楼阮彻底消失后，周越添到处找她，可却再也找不到她了。-再次相见，他看到她拉着一身黑的少年走进徐家家门，脸上带着明亮的笑。周越添一把拉住她，红着眼眶问道，“软软，你还要不要我……”白软乖巧的小姑娘还没说话，她身旁的人便斜睨过来，雪白的喉结轻滚，笑得懒散，“这位先生，如果你不想今天在警局过夜，就先松开我太太的手腕。”*女主视角先婚后爱/男主视角多年暗恋成真【偏爱你的人可能会晚，但一定会来。】*缺爱的女孩终于等到了独一无二的偏爱。',
        updateTime: '2023-06-13 04:10',
        chapters: [
            { chapterId: 1, chapterTitle: '第1章 是你占了我的便宜', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
            { chapterId: 2, chapterTitle: '第2章 楼阮，你怎么补偿我', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
        ],
        isRead: false
    }, {
        id: 6,
        title: '她引神明坠落',
        coverImg: '/images/她引神明坠落.jpg',
        author: '秋流萤',
        category: '职场婚恋',
        completed: true,
        wordCount: 23.9,
        readCount: 11.6,
        description: '已签出版，详情见抖音秋流萤x沈黛怡出身京北医学世家，这年，低调的母亲生日突然举办宴席，各大名门纷纷前来祝福，她喜提相亲。相亲那天，下着纷飞小雪。年少时曾喜欢过的人就坐在她相亲对象隔壁。宛若高山白雪，天上神子的男人，一如当年，矜贵脱俗高不可攀，叫人不敢染指。沈黛怡想起当年缠着他的英勇事迹，恨不得扭头就走。“你这些年性情变化挺大的。”“有没有可能是我们现在不熟。”宋清衍想起沈黛怡当年追在自己身边，声音娇嗲惯会娇，宛若妖女，勾他缠他。小妖女不告而别，时隔多年再相遇，对他疏离避而不及。',
        updateTime: '2023-02-25 07:38',
        chapters: [
            { chapterId: 1, chapterTitle: '第01章 宋清衍', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
            { chapterId: 2, chapterTitle: '第02章 追不上', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
        ],
        isRead: false
    }, {
        id: 7,
        title: '规则怪谈：摆烂人扭转国运',
        coverImg: '/images/规则怪谈：摆烂人扭转国运.png',
        author: '玫瑰星球',
        category: ' 悬疑脑洞',
        completed: true,
        wordCount: 48.5,
        readCount: 10.5,
        description: '[已签出版，具体见番外][温柔坚韧地质学研究生x痞帅纹身师/年龄差/久别重逢/双向救赎]聚会上，有人问许星，这辈子最遗憾的事是什么？她想了想，答：“没能让他听见我的声音，没能说喜欢他，没能……找到他。”-四年前，温峋外出带回一个小哑巴。小哑巴一双鹿眼，又乖又软，还住他对面，唯一的缺点就是太娇气。从此，小弟们眼睁睁看着向来桀骜不驯，野性十足的大佬，一改往日痞气形象，用尽所有耐心养一朵娇气的花儿。夏夜，温峋小心翼翼养的花儿偷吻了他，却在转身时不小心碰倒果盘，杨梅和她的心跳一样，乱七八糟撒了满地。-四年后的雪夜，许星被人表白，她还没来得及反应，就被人拉回家狠狠吻住。温峋不管不顾，捧出三个装满星星的罐子。他喉间发涩，声音发颤：“一颗星星一天，这里一共1582天。许星，离开你的每一天老子都在想你，想得快要发疯。”他低头吻她，终于认输：“我这辈子都是你的人，你别想耍赖。”许星哭着骂他：“混蛋！”温峋贴着她的额头，气息灼人，又野又坏：“我是混蛋，你是什么？”许星：“混蛋他媳妇儿。”-宇宙黑暗幽冷，你是唯一的发光体。',
        updateTime: '2023-11-30 07:00',
        chapters: [
            { chapterId: 1, chapterTitle: '第一章 国运值即将清零', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
            { chapterId: 2, chapterTitle: '第二章 二次抽取，SSS级天赋！', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
        ],
        isRead: false
    },
    {
        id: 8,
        title: '炽野温柔',
        coverImg: '/images/炽野温柔.jpg',
        author: '九绾',
        category: ' 青春甜宠',
        completed: true,
        wordCount: 65,
        readCount: 9.1,
        description: '[已签出版，具体见番外][温柔坚韧地质学研究生x痞帅纹身师/年龄差/久别重逢/双向救赎]聚会上，有人问许星，这辈子最遗憾的事是什么？她想了想，答：“没能让他听见我的声音，没能说喜欢他，没能……找到他。”-四年前，温峋外出带回一个小哑巴。小哑巴一双鹿眼，又乖又软，还住他对面，唯一的缺点就是太娇气。从此，小弟们眼睁睁看着向来桀骜不驯，野性十足的大佬，一改往日痞气形象，用尽所有耐心养一朵娇气的花儿。夏夜，温峋小心翼翼养的花儿偷吻了他，却在转身时不小心碰倒果盘，杨梅和她的心跳一样，乱七八糟撒了满地。-四年后的雪夜，许星被人表白，她还没来得及反应，就被人拉回家狠狠吻住。温峋不管不顾，捧出三个装满星星的罐子。他喉间发涩，声音发颤：“一颗星星一天，这里一共1582天。许星，离开你的每一天老子都在想你，想得快要发疯。”他低头吻她，终于认输：“我这辈子都是你的人，你别想耍赖。”许星哭着骂他：“混蛋！”温峋贴着她的额头，气息灼人，又野又坏：“我是混蛋，你是什么？”许星：“混蛋他媳妇儿。”-宇宙黑暗幽冷，你是唯一的发光体。',
        updateTime: '2023-08-10 10:57',
        chapters: [
            { chapterId: 1, chapterTitle: '第1章 初遇·小哑巴和温野狼', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
            { chapterId: 2, chapterTitle: '第2章 他的骨头一定很漂亮！', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
        ],
        isRead: false
    }, {
        id: 9,
        title: '卿乃朝朝暮暮',
        coverImg: '/images/卿乃朝朝暮暮.jpg',
        author: '暮色陈陈YA',
        category: '青春甜宠',
        completed: true,
        wordCount: 28.4,
        readCount: 4.9,
        description: '【已签约出版】原书名：卿乃朝朝暮暮【人间超乖小学霸VS风流成性贵公子 】“她谁啊？”“我妹，朝暮。”“朝暮，”岁聿喃喃低语，“朝朝暮暮。”见第一眼，岁聿这个玩物彻底栽在朝暮的身上了。以前，怎么没见过这么美的人。朝暮天生娇艳小红唇，肤光胜雪，特别是褐色的眼眸，清澈透明，笑与不笑都让人不禁沦陷。在校园素颜朝天的时代，朝暮凭借天生丽质在众人面前脱颖而出。放学后，岁聿堵住要回家的朝暮，精致的眉眼轻挑，“涂口红了？”女孩颤抖出声：“没有。”岁聿步步逼近，单手懒散撑着墙，唇角轻勾：“不相信。”“小白雪公主，让爷亲口。” 少年循循善诱，嗓音沙哑又好听，“亲完就知道了。”To ZM：于我，你是永远。“岁岁落暮暮坠轮轮暮暮即慕慕”排雷：感情洁癖的勿进！！！ 不喜欢就不要进了 免得自己找气受 ！是双洁！！！（理解的双洁没到最后一步 男主初吻在 除了女主没对任何人动过心 ）［本文争议很大 我相信每位读者大大都有自己的评判标准 萝卜青菜各有所爱嘛 不要因为其它的言语误解本书 诚心阅读者想看就看 谢谢小可爱们的阅读］',
        updateTime: '2022-11-30 16:37',
        chapters: [
            { chapterId: 1, chapterTitle: 'ZM 第1章 接人', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
            { chapterId: 2, chapterTitle: 'SY 第2章 不知道', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
        ],
        isRead: false
    },
    {
        id: 10,
        title: '她不乖！要哄',
        coverImg: '/images/她不乖！要哄.jpg',
        author: '君不弃',
        category: '青春甜宠',
        completed: true,
        wordCount: 27.0,
        readCount: 4.6,
        description: '[已签出版]【爆甜轻松➕双洁治愈➕野性甜宠➕校园】娇纵随性大小姐✖️邪妄傲娇野少爷“疼！你别碰我了……”季书怡微红的眼圈湿雾雾的瞪着头顶的‘大狼狗’，幽怨的吸了吸鼻子：“你就会欺负我！”都说京大法学系的江丞，眼高于顶邪妄毒舌，从不屑与任何人打交道，只有季书怡知道背地里他是怎样诱哄着把她藏在少年宽大的外套下吻的难舍难分。开学第一天，季书怡就在众目睽睽之下惹了江丞不爽。所有人都以为她要完。可后来众人看到的是，大魔王为爱低头的轻哄:“小祖宗，哪又惹你不高兴了？”季书怡永远记得那个夜晚，寻遍了世界来哄她的江丞跪在满地荆棘玫瑰的雪夜里，放下一身傲骨眉眼间染尽了卑微，望着站在灯光下的她小心翼翼的开口:“美丽的仙女请求让我这愚蠢的凡人许个愿吧。”她仰着下巴，高高在上:“仙女准你先说说看。”他说:“想哄你……一辈子。”那个雪夜，江丞背着她走了很远很远，在他背上娇怨:“你以后不许欺负我。”“好，不欺负。”——————如果可以预见未来，当初一定不欺负你，从此只为你一人时刻破例。你如星辰落入人间，是我猝不及防的心动。',
        updateTime: '2023-05-19 00:24',
        chapters: [
            { chapterId: 1, chapterTitle: '第001章 冤家', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
            { chapterId: 2, chapterTitle: '第002章 野兔？', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
        ],
        isRead: false
    }, {
        id: 11,
        title: '别暗恋我呀',
        coverImg: '/images/别暗恋我呀.jpg', author: '明之九',
        category: '青春甜宠',
        completed: true,
        wordCount: 15.3,
        readCount: 3.1,
        description: '【大学校园+破镜重圆+甜虐交织+男主不渣】在那场暗无天日的暗恋里，喻夏始终是自卑、不漂亮的存在。她见过陈妄穿过球场恣意妄为的身影。也见过他收到情书时淡漠疏离的笑容。更见过他怀里的女孩换过一个又一个的浪荡。每一个她见过的陈妄，都不属于她。——结婚前一晚。陈妄收到妻子八年前写给他的信：【喜欢你的人太多了，我只能远远望着，夏天的风终究太过闷热，所以这个夏天结束，我也放弃你啦，陈妄，祝你永远风光霁月，大步向前。】署名：喻夏。陈妄放下信，提笔回给八年前的她：“别暗恋我，我会奔你而来。”他回头，抱住妻子。陈妄喜欢喻夏，谁都会知道。【温柔女律师X航天工程设计师】',
        updateTime: '2023-07-10 23:40',
        chapters: [
            { chapterId: 1, chapterTitle: '第1章 再遇陈妄', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
            { chapterId: 2, chapterTitle: '第2章 他从来不缺女孩喜欢', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
        ],
        isRead: false
    },
    {
        id: 12,
        title: '过来亲一下',
        coverImg: '/images/过来亲一下.jpg',
        author: '吃柚子不吐皮吖',
        category: '青春甜宠',
        completed: true,
        wordCount: 25.5,
        readCount: 2.9,
        description: '【已签约出版】 ☆冷淡温柔少年X厌世颓废少女☆ 【1V1 小甜饼｜校园 沙雕 甜宠 救赎 治愈向】 温既白一直真情实感的以为新同桌是一个恃帅行凶对谁都冷淡的高冷校草。 直到后面有一天，温既白从他的百度中看到了这样一条搜索记录—— 〔很烦，喜欢上自己同桌了怎么办？〕',
        updateTime: '2022-08-11 19:00',
        chapters: [
            { chapterId: 1, chapterTitle: '第1章 阿姨，您哭错地了', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
            { chapterId: 2, chapterTitle: '第2章 我看上了这双袜子', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
        ],
        isRead: false
    },
    {
        id: 13,
        title: '快穿之满级宿主爱打脸',
        coverImg: '/images/快穿之满级宿主爱打脸.jpg',
        author: '爱吃双蛋拌泡菜',
        category: '快穿',
        completed: false,
        wordCount: 30.0,
        readCount: 0.8,
        description: '【打脸爽文】 虞凌阑意外绑定系统，被要求改变原主命运，走上人生巅峰。 虞凌阑心想，这她熟啊，打脸装逼谁不会。 于是乎，虞凌阑便走上了一条装逼之路。 我过目不忘，是个学神 我有三十套房，是个富婆 我有半片疆土，是个女皇 …… 任务做得爽爽爽，还有个男人来跟随，虞凌阑心想，还能怎么着，收着呗。',
        updateTime: '2022-08-19 23:50',
        chapters: [
            { chapterId: 1, chapterTitle: '第1章 真千金不做假凤凰', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
            { chapterId: 2, chapterTitle: '第2章 真千金不做假凤凰2', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
        ],
        isRead: false
    },
    {
        id: 14,
        title: '少年行',
        coverImg: '/images/少年行.jpg',
        author: '杜柯',
        category: '文学小说',
        completed: false,
        wordCount: 17.8,
        readCount: 0.3,
        description: '《少年行》是一部写少年成长的纪实小说。主人公在现实的威逼和诱惑下，苦闷呻吟，不知所措，甚至荒诞百出的人生经历，影射时代对于一代人的残压迫。 也许，每个人的青春都经历过残酷，只是一个时代有一个时代的残酷样本，残酷的方式和风格不同而已。',
        updateTime: '2022-06-28 17:28',
        chapters: [
            { chapterId: 1, chapterTitle: '第一章 县城', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
            { chapterId: 2, chapterTitle: '第二章 爷爷', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
        ],
        isRead: false
    }, {
        id: 15,
        title: '藏于盛夏',
        coverImg: '/images/藏于盛夏.jpg',
        author: '秋日凉',
        category: '青春甜宠',
        completed: true,
        wordCount: 30.5,
        readCount: 30.5,
        description: '《【已签约出版】【 救赎×日久生情×校园虐文】 甜软乖学生×痞帅不良少年 那年盛夏的似乎比往年都要热，毕业照上的女孩笑的很甜，她的身后是穿着白衬衫笑的张扬的少年。 相逢是盛夏，别离也是盛夏，他的小玫瑰永远藏在了那个盛夏。 【“吓到了吗？小同学。” “嗯。” “别怕。”】 【“真的不考虑和我在一起吗？小同学。” “你追上我，我就考虑。”】 【“下辈子等着我好不好？” “不等骗子。”】 【“吃颗糖就能变开心了。” “我吃了那么多糖，为什么我还是感【已签约出版】【 救赎×日久生情×校园虐文】】',
        updateTime: '2023-11-18 14:39',
        chapters: [
            { chapterId: 1, chapterTitle: '第一章 校霸成了我同桌', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
            { chapterId: 2, chapterTitle: '第二章 再抖腿给老子滚', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
        ],
        isRead: false
    }
    , {
        id: 16,
        title: '以夏天的名义',
        coverImg: '/images/以夏天的名义.jpg',
        author: '折枝桂w',
        category: '青春甜宠',
        completed: true,
        wordCount: 36.2,
        readCount: 25,
        description: '【已签出版｜双洁｜甜宠苏撩｜浪子回头｜暗恋成真｜追妻火葬场】周妄，人如其名，傲气又狂妄，身边女生无数，万花丛中过，人称附中女神收割机，但周少爷眼高于顶，每次被人表白都兴致缺缺。周岑两家是世交，高二那年，一直寄养在乡下的岑家大小姐被接回了岑家，看着漂亮又乖巧，实际上倔得要死，还有点小心机。为了能在岑家顺利生活下去，岑漾咬着牙接近周妄。但周妄觉得岑漾太过冷静温和，面对女生的示好，他嚣张拒绝，“我不想带个妹妹在身边。”他宛如热烈的夏天，身边永远都围满了人，岑漾发觉周妄好像真是没有回应的山谷，她只能站在人群边缘看他。但毕业的那个夏天，在海边，周妄拉住女生的手，“当初是我眼瞎，现在你还要不要我？”“我会奔向你，以夏天的名义。',
        updateTime: '2023-08-30 17:21',
        chapters: [
            { chapterId: 1, chapterTitle: '第1章 好他妈牛逼一张脸', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
            { chapterId: 2, chapterTitle: '第2章 被一块石头欺负哭了', chapterContent: '由于版权原因，各位读者请前往官网阅读~' },
        ],
        isRead: false
    }
]

// 获取本地存储中的用户数据
let userData = JSON.parse(localStorage.getItem('userData')) || [];

export { books, userData }
